<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#¿Qué-es-un-DataFrame?" data-toc-modified-id="¿Qué-es-un-DataFrame?-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>¿Qué es un <em>DataFrame</em>?</a></span></li><li><span><a href="#Creación-de-DataFrames" data-toc-modified-id="Creación-de-DataFrames-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Creación de <em>DataFrames</em></a></span><ul class="toc-item"><li><span><a href="#DataFrame-vacío" data-toc-modified-id="DataFrame-vacío-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span><em>DataFrame</em> vacío</a></span></li><li><span><a href="#DataFrame-desde-un-diccionario" data-toc-modified-id="DataFrame-desde-un-diccionario-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span><em>DataFrame</em> desde un diccionario</a></span></li><li><span><a href="#DataFrame-desde-un-NumPy-array" data-toc-modified-id="DataFrame-desde-un-NumPy-array-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span><em>DataFrame</em> desde un NumPy <em>array</em></a></span></li><li><span><a href="#DataFrame-desde-lista-de-diccionarios" data-toc-modified-id="DataFrame-desde-lista-de-diccionarios-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span><em>DataFrame</em> desde lista de diccionarios</a></span></li></ul></li><li><span><a href="#loc-e-iloc" data-toc-modified-id="loc-e-iloc-3"><span class="toc-item-num">3&nbsp;&nbsp;</span><code>loc</code> e <code>iloc</code></a></span><ul class="toc-item"><li><span><a href="#Selección-a-través-de-un-único-elemento" data-toc-modified-id="Selección-a-través-de-un-único-elemento-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Selección a través de un único elemento</a></span></li><li><span><a href="#Selección-a-través-de-una-lista-de-valores" data-toc-modified-id="Selección-a-través-de-una-lista-de-valores-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Selección a través de una lista de valores</a></span></li><li><span><a href="#Selección-de-un-rango-de-datos-a-través-de-un-corte" data-toc-modified-id="Selección-de-un-rango-de-datos-a-través-de-un-corte-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Selección de un rango de datos a través de un corte</a></span></li><li><span><a href="#Seleccionar-basado-en-una-condición" data-toc-modified-id="Seleccionar-basado-en-una-condición-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Seleccionar basado en una condición</a></span></li></ul></li><li><span><a href="#Creación-y-borrado-de-columnas" data-toc-modified-id="Creación-y-borrado-de-columnas-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Creación y borrado de columnas</a></span><ul class="toc-item"><li><span><a href="#Creación-de-columnas" data-toc-modified-id="Creación-de-columnas-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Creación de columnas</a></span></li></ul></li></ul></div>

# ¿Qué es un *DataFrame*?

Un *DataFrame* es una estructura de datos con dos dimensiones en la cual se puede guardar datos de distintos tipos (strings, enteros, decimales, factores, etc.). 

Es similar a una hoja de cálculo  o una tabla de SQL.

Al igual que en las *Series*, siempre vamos a tener índice que empieza por 0. La diferencia con las *Series* es que en el *DataFrame* tenemos más dimensiones y que, por lo tanto, podremos tener más columnas con valores.

# Creación de *DataFrames* 

Para crear *DataFrames* usaremos el constructor `pd.DataFrame()`, el cual va a aceptar 3 parámetros principales: 

- `data`: estructura de datos que queremos convertir a *DataFrame*, puede ser un *array*, un diccionario, una lista, etc. 
- `index`: ìndice a aplicar a las filas. Si no se especifica, se asiganrá uno por defecto formado por números enteros entre `0` y `n-1`, siendo `n` el numero de filas del *DataFrame*.
- `column`: nombre que le queremos aplicar a las columnas. Si no añadimos nada se asignará uno automático formado por números enteros entre `0` y `n-1` siendo `n` el número de columnas. 

Algunas estructuras a partir de las cuales es posible crear *DataFrames*:

- Diccionarios 
- NumPy array
- Lista de diccionarios

In [1]:
# antes que nada tenemos que importarnos pandas y NumPy

import pandas as pd
import numpy as np

## *DataFrame* vacío

In [2]:
vacio = pd.DataFrame()
vacio

Empty DataFrame
Columns: []
Index: []

## *DataFrame* desde un diccionario

In [3]:
diccionario1 = {"nombre": ["María", "Elena"], 
               "apellido": ["López", "Pérez"], 
               "dni": ["009836289-L", "0975478953-P"], 
               "edad": [45, 55]}

In [7]:
clientes = pd.DataFrame(diccionario1)
clientes

  nombre apellido           dni  edad
0  María    López   009836289-L    45
1  Elena    Pérez  0975478953-P    55

Lo que ha ocurrido es que las *keys* de nuestro diccionario se han convertido en las columnas y los *values* como los valores de cada columna.

In [6]:
#ejemplo en clase

#si quiero sacar Elena
clientes.loc(1, 'nombre')

TypeError: __call__() takes from 1 to 2 positional arguments but 3 were given

## *DataFrame* desde un NumPy array

In [9]:
array = np.array([[1,2,3], [3,4,5], [6,7,8]])
array

array([[1, 2, 3],
       [3, 4, 5],
       [6, 7, 8]])

In [10]:
numeros = pd.DataFrame(array)
numeros

   0  1  2
0  1  2  3
1  3  4  5
2  6  7  8

Lo que ha pasado es que nos ha colocado cada array en una columna de nuestro *DataFrame*.
Las filas del NumPy array siguen siendo interpretadas como filas del dataframe.

Fijaos que en este caso, como no especificamos el nombre de las columnas nos los pone pandas como por defecto, números enteros empezando por el 0. 

Para reasignar el valor de la columnas lo que podemos usar es el parámetro `columns`:

In [11]:
numeros = pd.DataFrame(array, columns = ["enero", "febrero", "marzo"])
numeros

   enero  febrero  marzo
0      1        2      3
1      3        4      5
2      6        7      8

Podríamos cambiar también de las etiquetas usando el parámetro `index`:

In [12]:
numeros = pd.DataFrame(array, columns = ["enero", "febrero", "marzo"], 
                      index = [2019, 2020, 2021])
numeros

      enero  febrero  marzo
2019      1        2      3
2020      3        4      5
2021      6        7      8

## *Dataframe* desde lista de diccionarios

Los diccionarios deberán compartir el mismo conjunto de claves que se interpretarán como etiquetas de columnas.

In [13]:
lista_dicc = [{"nombre": ["María", "Elena"], 
               "apellido": ["López", "Pérez"], 
               "dni": ["009836289-L", "0975478953-P"], 
               "edad": [45, 55]}, 
             {"nombre": ["Lorena", "Laura"], 
               "apellido": ["Martinez", "García"], 
               "dni": ["123452986-Y", "183609547-M"], 
               "edad": [24, 26]}]

In [14]:
df = pd.DataFrame.from_dict(lista_dicc)
df

            nombre            apellido                          dni      edad
0   [María, Elena]      [López, Pérez]  [009836289-L, 0975478953-P]  [45, 55]
1  [Lorena, Laura]  [Martinez, García]   [123452986-Y, 183609547-M]  [24, 26]

# `loc` e `iloc`

En los *dataframes* existen diferentes formas de seleccionar los registros de las filas y columnas. Las dos formas más importantes son

- `loc`: va a seleccionar elementos en base a las etiquetas de nuestras filas o columnas. 


- `iloc`: se basa en la posición, es decir, los índices.

In [17]:
# aunque lo veremos más adelante podemos importar muchos tipos de datos usando pandas
# la forma de hacerlo es usando el método "pd.read_csv"

df = pd.read_csv("./data.csv", index_col=["Day"])

# veamos que datos tenemos en nuestro dataframe
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

## Selección a través de un único elemento

Vamos a seleccionar la `humedad` que hace el `martes`.

1️⃣ Usando `loc`, la sintaxis sería:

```python
loc[etiqueta_fila , etiqueta_columna]
```

In [18]:
df.loc["Tue", "Humidity"]

96

Imaginemos que queremos sacar una fila en concreto pero todas las columnas.
En estos casos tendremos que usar `:`, esto índica que lo queremos todo. Es decir: 

```python
[filas-deseadas, :] # le estamos diciendo que nos busque por una fila dada y nos devuelva todas las columnas

[:, columna-deseada] # devuelvenos todas las filas de la columna que especifiquemos
```

In [19]:
# devuelvenos todas las columnas de la fila "Tue"

df.loc["Tue", :]

Weather        Sunny
Temperature    19.67
Wind              28
Humidity          96
Name: Tue, dtype: object

In [20]:
# devuelvenos todas las filas que correspondan con la columna "Wind"

df.loc[:, "Wind"]

Day
Mon    13
Tue    28
Wed    16
Thu    11
Fri    26
Sat    27
Sun    20
Name: Wind, dtype: int64

2️⃣ Usando `iloc`, la sintaxis sería:

```python
iloc[índice_fila , índice_columna]
```

El elemento que queremos está en la fila 2 (que es la posición 1, recordemos que empezamos por el 0) y en la columna 4 (que es la posición 3)

In [21]:
df.iloc[1,3]

96

Igual que con el `loc`, en el `iloc` podemos seleccionar también varias filas para una columna y viceversa.

In [22]:
# devuelve todos los valores de las columnas para la fila 1

df.iloc[1,:]

Weather        Sunny
Temperature    19.67
Wind              28
Humidity          96
Name: Tue, dtype: object

In [23]:
# devuelve todos los valores de las filas para la columna 4

df.iloc[:,3]

Day
Mon    30
Tue    96
Wed    20
Thu    22
Fri    79
Sat    62
Sun    10
Name: Humidity, dtype: int64

## Selección a través de una lista de valores

1️⃣ `loc`

In [24]:
# devuelveme los valores de las filas "Tue" y "Sat" para la columna "Wind"

df.loc[["Tue", "Sat"], "Wind"]

Day
Tue    28
Sat    27
Name: Wind, dtype: int64

In [25]:
# seleccionamos múltiples filas y columnas. 
# ⚠️ Si nos fijamos ya nos devuelve un dataframe!

df.loc[["Tue", "Sat"], ["Temperature", "Wind"]]

     Temperature  Wind
Day
Tue        19.67    28
Sat        11.07    27

2️⃣ `iloc`

In [26]:
# de la misma forma lo podremos hacer con el iloc pasando los índices 

df.iloc[[1, 5],3]

Day
Tue    96
Sat    62
Name: Humidity, dtype: int64

In [27]:
# seleccionamos múltiples filas y columnas y de nuevo nos devuelve un dataframe

df.iloc[[1,5], [1,2]]

     Temperature  Wind
Day
Tue        19.67    28
Sat        11.07    27

## Selección de un rango de datos a través de un corte

1️⃣ `loc`: con este método podemos usar la sintaxsis A:B para seleccionar datos de la etiqueta A a B (ambos incluidos).

In [28]:
# extrae los valores para las filas "Thu" y "Fri" y las columnas entre "Temperature" y "Humidity"

df.loc[['Thu', 'Fri'], 'Temperature':'Humidity' ]

     Temperature  Wind  Humidity
Day
Thu        14.44    11        22
Fri        10.51    26        79

También podemos usar la sintaxis: 

```python
[start:stop:step]

df[A:B:2]
```

Con esto seleccionaremos los datos de la etiqueta A a la B con saltos de dos en dos (de nuevo, A y B están incluidos).

In [29]:
# en este caso estamos seleccionadondo las filas de "Mon" a "Fri" con saltos de dos en dos

df.loc['Mon':'Fri':2 , :]

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Wed   Sunny        17.51    16        20
Fri  Shower        10.51    26        79

2️⃣ `iloc`: de la misma forma que con el `loc` podemos usar la sintaxis A:B

In [30]:
# extrae todos los datos de las filas 1 y 2, de las columnas 0 a 3

df.iloc[[1, 2], 0 : 3]

    Weather  Temperature  Wind
Day
Tue   Sunny        19.67    28
Wed   Sunny        17.51    16

In [31]:
# extrae toda la información desde la fila 0 hasta la 7 en saltos de dos en dos incluyendo todas las columnas

df.iloc[0:7:2, :]

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Wed   Sunny        17.51    16        20
Fri  Shower        10.51    26        79
Sun   Sunny        17.50    20        10

## Seleccionar basado en una condición

Usando `loc` con condiciones. Aquí tendremos que usar los operadores comparativos como `>`, `<`, `>=`, `<=`, `==` o `!=`

In [32]:
df.loc[df.Temperature > 12, :]

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Sun   Sunny        17.50    20        10

In [33]:
# es lo mismo que:

df[df.Temperature > 12]

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Sun   Sunny        17.50    20        10

¿Y si queremos que se cumplan varias condiciones?

En este caso tendremos que usar los operadores `&` o `|`. Veamos lo que significan: 

- `&`: es como el operador `and`. En este caso se tendrán que cumplir todas las condiciones que le pasemos. 


- `|`: es como el operador `or`. En este caso nos devolverá datos de las condiciones que se cumplan, pero no tienen porque cumplirse todas a la vez. Sólo una condición o otra, o ambas.

In [34]:
# ¿qué estamos haciendo aquí? Seleccionar aquellas filas donde se cumpla la condición de que el viento es mayor que 20 y el tiempo era soleado.
# además estamos especificando que nos devuelva solo las columnas de "Temperature" y " Wind"
# SE TIENEN QUE CUMPLIR LAS DOS CONDICIONES

df.loc[(df.Wind > 20) & (df.Weather == 'Sunny'), 
    ['Temperature','Wind']]

     Temperature  Wind
Day
Tue        19.67    28

In [35]:
# en este caso nos devolverá los datos donde el viento sea > 20 o el tiempo sea soleado

df.loc[(df.Wind > 20) | (df.Weather == 'Sunny'), 
    ['Temperature','Wind']]

     Temperature  Wind
Day
Mon        12.79    13
Tue        19.67    28
Wed        17.51    16
Fri        10.51    26
Sat        11.07    27
Sun        17.50    20

2️⃣ `iloc`: obtendremos un ValueError si pasamos la condición directamente a la sentencia

In [ ]:
df.iloc[df.Temperature > 15, :]

⚠️ Obtenemos el error porque `iloc` no puede aceptar una Serie booleana. Sólo acepta una lista booleana. Podemos utilizar la función `list()` para convertir una Serie en una lista booleana.

In [ ]:
# nos devuelve todos aquellos valores donde la temperatura sea mayor que 15

df.iloc[list(df.Temperature > 15), :]

    Weather  Temperature  Wind  Humidity
Day
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Sun   Sunny        17.50    20        10

In [41]:
list(df.Temperature > 15)

[False, True, True, False, False, False, True]

In [42]:
# con multiples condiciones usaremos también el comando list()

df.iloc[list((df.Humidity > 50) & (df.Weather == 'Shower')), :]

    Weather  Temperature  Wind  Humidity
Day
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62

**Por lo tanto, las diferencias entre `loc` e `iloc` son:**

![image.png](attachment:image.png)

# Creación y borrado de columnas

In [43]:
# antes de nada recordemos como es nuestro dataframe
df

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

## Creación de columnas

Imaginemos que queremos crear una columna nueva, esto lo podemos hacer de muchas formas, veamos algunas de las más importantes: 

- A partir de operaciones entre columnas o de una columna
- Método `assign()`
- Método `insert()`

1️⃣ Supongamos que queremos tener la temperatura tambien en grados Farenheit. Podríamos crearnos una columna nueva aplicando una serie de operaciones sobre la que ya tenemos:

In [44]:
# lo primero que hacemos es establecer el nombre de la nueva columna que 
# quiero

df["Farenheit"] = (df["Temperature"] * 9/5) + 32

In [45]:
# si ahora volvemos a ver nuestro dataframe tendremos una nueva columna
## con la temperatura convertida en Farenheit

df.head()

    Weather  Temperature  Wind  Humidity  Farenheit
Day
Mon   Sunny        12.79    13        30     55.022
Tue   Sunny        19.67    28        96     67.406
Wed   Sunny        17.51    16        20     63.518
Thu  Cloudy        14.44    11        22     57.992
Fri  Shower        10.51    26        79     50.918

2️⃣ `assign`: nos va a permitir incluir nuevas columnas en nuestro dataframe. Estas nuevas columnas pueden ser: 

- A partir de datos de nuestro dataframe (como vimos en el apartado anterior) 
- Pasándole nosotras una lista con los valores que queremos incluir en la nueva columna.

En el método `assign` tendremos que: 

- Indicar el nombre de la columna nueva que queremos (en este ejemplo `temp_f`).
- La operación que va a definir los valores de nuestra nueva columna.

In [46]:
df.assign(temp_f=df['Temperature'] * 9 / 5 + 32)

    Weather  Temperature  Wind  Humidity  Farenheit  temp_f
Day
Mon   Sunny        12.79    13        30     55.022  55.022
Tue   Sunny        19.67    28        96     67.406  67.406
Wed   Sunny        17.51    16        20     63.518  63.518
Thu  Cloudy        14.44    11        22     57.992  57.992
Fri  Shower        10.51    26        79     50.918  50.918
Sat  Shower        11.07    27        62     51.926  51.926
Sun   Sunny        17.50    20        10     63.500  63.500

In [47]:
# tambien le podemos pasar una lista,pero importante!!! Tiene que tener la misma longitud que nuestro dataframe 
df = df.assign(indices= [1,2,3,4,5,6,7])

In [49]:
# comprobamos si se creo la columna: 

df.head(5)

    Weather  Temperature  Wind  Humidity  Farenheit  indices
Day
Mon   Sunny        12.79    13        30     55.022        1
Tue   Sunny        19.67    28        96     67.406        2
Wed   Sunny        17.51    16        20     63.518        3
Thu  Cloudy        14.44    11        22     57.992        4
Fri  Shower        10.51    26        79     50.918        5

3️⃣ `insert`: nos va a permitir incluir nuevas columnas en nuestro dataframe, en una posición que nosotros le demos.

Los parámetros que recibe son: 

- `loc`: typo integer. Índice de inserción/(la posición donde queremos insertar los datos, en la primera, quinta, sexta columna por ejemplo). Debe cumplir con `0 <= loc <= len(columns)`.


- `column`: typo string. Nombre de la columna.

- `values`: los valores que queremos meter.

- `allow_duplicates`: booleano. Por defecto es `False`.

📌 Genera un `ValueError` si la columna ya está contenida en el DataFrame, a menos que `allow_duplicates` esté establecido en `True`.

In [50]:
# en este ejemplo estamos creando una columna nueva que se llama "indice2" en la primera columna con números del 1 al 7. 

df.insert(0, "indice2", range(1,8))

In [ ]:
# ⚠️ Si volvieramos a crear otra colummna con el nombre de una columna ya existente nos daría error. 

df.insert(0, "indice2", range(1,8))

In [52]:
# comprobamos si se nos creo la columna: 

df.head(2)

     indice2 Weather  Temperature  Wind  Humidity  Farenheit  indices
Day
Mon        1   Sunny        12.79    13        30     55.022        1
Tue        2   Sunny        19.67    28        96     67.406        2

---
**EJERCICIOS** 

1️⃣ Usando el diccionario dado cread un *DataFrame*.

  ```python
    diccionario = {"Nombre": ["Alejandro", "Anne", "Ana"], 
              "Apellidos": ["Sanz", "Krus", "García" ], 
              "Edad": [29, 30, 33], 
              "Provincia": ["Valencia", "Madrid", "Madrid"], 
              "Estudios": ["Físico", "Ingeniera", "Biologa"]}
  ```
    
2️⃣ Cread un *array* de NumPy con numeros aleatorios del 1 al 100 de dos dimensiones de 3 filas y 5 columnas (necesitaremos recordar conceptos adquiridos en la lección de NumPy 1). Los nombres de las columnas deben ser los dias de la semana de Lunes a Viernes. 

3️⃣ Empecemos a trabajar con `loc`e `iloc`. Usando el primer dataframe: 

   - Extrae todos los nombres de nuestro dataframe. 
   - ¿Cuántos años tiene Alejandro?
   - Extrae toda la información de las dos primeras columnas
   - ¿Quién tiene más de 30 años? Devolved solo el nombre. 
   - ¿Quién es de Madrid y tiene 30 años?
   - ¿Quién es Ingeniera o tiene menos de 30 años?

4️⃣ Momento de crear nuevas columnas: 

   - Cread una nueva columna a la que le sumeis 4 a todas las edades
   - Imaginemos ahora que Alejandro tiene 2 hermanos, Anne 1 y Ana 3. Insertad una nueva columna en la última posición con el número de hermanos de cada uno. 
   - Insertar una nueva columna donde tengamos el nombre y apellidos juntos. 
   
      **NOTA** De la misma forma que sumamos columnas numéricas podemos sumar columnas con strings

---

In [69]:
dias_semana = ["Lunes", "Martes", "Miércoles" ,"Jueves", "Viernes", "Sábado", "Domingo"]

In [70]:
#ejercicio 1
diccionario = {"Nombre": ["Alejandro", "Anne", "Ana"], 
            "Apellidos": ["Sanz", "Krus", "García" ], 
            "Edad": [29, 30, 33], 
            "Provincia": ["Valencia", "Madrid", "Madrid"], 
            "Estudios": ["Físico", "Ingeniera", "Biologa"]}

df_ejer = pd.DataFrame(diccionario, columns = dias_semana)

In [71]:
df_ejer.head(5)

Empty DataFrame
Columns: [Lunes, Martes, Miércoles, Jueves, Viernes, Sábado, Domingo]
Index: []

In [57]:
# ejercicio 2:

array_ejer = np.random.randint(0,100, (2,3,5))
array_ejer

array([[[27, 94, 65, 19, 30],
        [ 2, 62, 49, 65, 22],
        [41, 63, 62, 98, 37]],

       [[99, 43, 24, 19, 52],
        [73, 37, 64,  1, 49],
        [18, 37, 99, 54, 74]]])

---

In [95]:
df_ejer = pd.DataFrame(diccionario)
df_ejer.head(5)

      Nombre Apellidos  Edad Provincia   Estudios
0  Alejandro      Sanz    29  Valencia     Físico
1       Anne      Krus    30    Madrid  Ingeniera
2        Ana    García    33    Madrid    Biologa

In [96]:
#extrae todos los nombres de nuestro df
df_ejer.loc[:,"Nombre"]

0    Alejandro
1         Anne
2          Ana
Name: Nombre, dtype: object

In [97]:
#    - ¿Cuántos años tiene Alejandro?
df_ejer.iloc[0,2]

29

In [98]:
# extrae las dos primeras columnas
df_ejer.iloc[:,0:2]

      Nombre Apellidos
0  Alejandro      Sanz
1       Anne      Krus
2        Ana    García

In [107]:
#    - ¿Quién tiene más de 30 años? Devolved solo el nombre. 
df_ejer.loc[df_ejer.Nombre,(df_ejer.Edad > 30)]

KeyError: "None of [Index(['Alejandro', 'Anne', 'Ana'], dtype='object')] are in the [index]"

In [102]:
#    - ¿Quién es de Madrid y tiene 30 años?
df_ejer.loc[(df_ejer.Provincia == "Madrid") & (df_ejer.Edad == 30)]

  Nombre Apellidos  Edad Provincia   Estudios
1   Anne      Krus    30    Madrid  Ingeniera

In [104]:
#    - ¿Quién es Ingeniera o tiene menos de 30 años?
df_ejer.loc[(df_ejer.Estudios == "Madrid") | (df_ejer.Edad < 30)]

      Nombre Apellidos  Edad Provincia Estudios
0  Alejandro      Sanz    29  Valencia   Físico